# Переменная - именуемая ячейка памяти,
# в которую можно записывать и менять значения
var = 6

# Чтобы посмотреть значение переменной
# print(<название переменной>)
# print(var)


# Типы данных объектов:
# int - целое число
# float - дробное число  1.9
# str - текстовый тип данных 'aa' "aa"
# bool - логический тип данных  True False

# Функция type(переменная) - показывает тип данных.
x = True
# print(type(x))


# Литералы - функции для изменения типов данных
# int() float() str() bool()
y = 7
y = float(y)
# print(y)

d = 7
n = 6.7
j = 'Hello'
j2 = '67'
b = True

# Задание: вы создаете число целое,
# дробное, булево и две строки
# Одна из строк содержит число,
# например, y = '67.9'
# Другая содержит слово, например,
# u = 'Hello'
# Попытаться конвертировать все
# переменные в различные типы данных
# print(литерал(переменная))
T = 0.1
# print(bool(T))


# В строку можно перевести любой тип данных
# Из строки можно перевести если то, что находится под кавычками,
# соответствует нужному типу данных
# Например, int('4') можно, int('aa')

x = 80
y = 81
# if x ** y > y ** x:
#     print('Икс в степени игрик больше игрик на икс')
# elif y ** x > x ** y:
#     print('Игрик в степени икс больше икс в степени игрик')
# else:
#     print('Эти возведения в степень одинаковые')

# type(название переменной) == тип данных - проверка на тип данных
# int float str bool
# Задание: вы пишите рандомную переменную
# Проверяете, является ли она целым числом
# Если да, то умножаете на 60
# Если это дробное: то превращаем в целое
# В противном случае пишем 'Это не численный тип данных'

# Персонаж -> кто его контрит -> Два билда (в каком случае использовать)
# Задание: переменная, в которой строчка (либо антимаг, либо гуль, либо CM)
# персонаж = 'антимаг'
#Здоровье = число
#Мана = число
#if персонаж == 'антимаг':
#   if условие основано на здоровье:
#       print('Билд')
#   elif основано на мане:
#        print(Билд)
#   print('Контрпик Lifestealer')


# Задание: две переменные
# Одна обозначает вчерашнюю температуру, другая позавчерашнюю, в дробных
# Если позавчера больше, чем вчера,
#   То мы смотрим насколько градусов одно больше другого
#   Если больше или равен 10
#          То мы выводим прогноз, что температура будет близкой позавчера
#   А если нет,
#       то мы повторяем разницу между позавчера и вчера
# else:
# Температура не изменится

# temp1 = 10
# temp2 = 1239082938126734390461
# if temp1 > temp2:
#     if temp2 - temp1 >= 10:
#         print("Температура будет близкой позавчера")
#     else:
#         print(temp2-temp1)
# elif temp1 < temp2:
#     if temp2 - temp1 >= 10:
#         print("Температура будет близкой вчера")
#     else:
#         print(temp2-temp1)
# else:
#     print("погода не изменится")

# for i in range(10):
#     print(i)
# Задание: сделать два похожих цикла
# Первый: range(-2, 10)
# Второй: range(1, 100, 7)

# Задание: проходитесь от 0, 50
# Выводите только нечетные числа
# i % 2 == 1






# Условные операторы, возвращают True или False
# 2 > 22  40 == 40
# Условные выражения
# if условие, которое мы хотим проверить самым первым:
# elif другое условие, если первое не выполняется:
# else: если вообще ничего не выполняется

# if x == y:
#    действие

# Вложенное условие: условие, которое проверяется, если
# первое условие работает (которое над ним)
#if type('fff') == int:
    #print('fgfgfgf')
    #if type('fff') == str:
        #print('iqqii')

# string.isdigit() Проверяет, может ли строка превратиться
# в число (на месте string строка или переменная, в которой строка)

#for i in range(1, 10, 2):
    #print(i)



