# Популярные ошибки:
# Синтаксические (написали что-то не по правилам языка):

# 1. Не написали символ: точку, двоеточие, запятую.
for i in range(10)
    i += 1
list_without_comma = [1, 2 3 , 4 5]

# 2. Не сделали нужный отступ. Всегда делайте отступ после объявления цикла,
# условного выражения, функции, класса. Одного tab достаточно
while i < 5:
i +=1

if 5 + 5 = 10:
i = 10 - 1

i = 2
if i % 2 == 0:
    if i > 4:
    i += 1



# 3. Оставили блок цикла, условного выражения, класса или функции пустым.
for i in range(10):

while True:

if 2 + 2 == 4:



#Если пока нечего писать, пишите внутрь этих выражений pass.

for i in range(10):
    pass

while True:
    pass

if 2 + 2 == 4:
    pass





